import re

def count_unique_words(text):
    text = text.lower()

    words = re.findall(r"\b\w+(?:'\w+)?\b", text)

    unique_words = set(words)
    return len(unique_words)

txt = """Технології розвиваються стрімко. Кожен день ми спостерігаємо нові досягнення в науці та техніці. Комп'ютери стають все потужнішими, а програмне забезпечення – складнішим. Проте, разом з цими досягненнями зростає і потреба в нових спеціалістах, здатних працювати з сучасними технологіями.
Важливо пам'ятати, що розвиток технологій впливає не лише на виробництво, але й на повсякденне життя людей. Смартфони, комп'ютери, розумні будинки, інтернет речей – все це робить наше життя зручнішим і ефективнішим. Технології змінюють наше життя кожного дня.
Однак, не слід забувати про кібербезпеку. Захист даних стає все важливішим питанням, адже зростання обсягу цифрової інформації вимагає надійних рішень для її захисту. Розробка нових методів шифрування та аутентифікації – ключ до безпеки в цифровому світі. Технології безпеки постійно розвиваються.
Таким чином, можна сказати, що технологічний прогрес має свої переваги та виклики."""

result = count_unique_words(txt)
print("Кількість унікальних слів:", result)